<template>
  <div class="home">
    <Article title="新股上市首日破发并非坏事 警示投资者打新风险" author="张三" source="http://qq.com" style="max-width:700px;margin:0 auto">

      <p class="one-p">10月22日是科创板新股<span class="linkNormal">中自科技</span>新股上市的日子。按照惯例，新股上市大都会给打新中签的投资者带来一笔无风险的“打新收益”。但对于中自科技的中签者来说，他们期待中的“打新收益”落空了，迎接他们的是新股上市首日破发的命运。打新中签者不仅没有得到“打新收益”，相反还要承担一定的“打新损失”，中自科技上市首日的收盘价较发行价下跌了6.87%。</p>
      <p class="one-p">新股上市首日破发，这对于打新中签者来说是非常揪心的一件事情。尤其是中自科技开盘即破发，没有给中签者丝毫的逃命机会。当天的最高价是70.50元，低于70.90元的发行价，这意味着打新中签者悉数被套，全部都要为自己“中签”的好运而付出代价。</p>
      <p class="one-p">那么，中自科技为何会出现上市首日破发现象呢？究其原因主要有两点。一是发行价偏高，高达每股70.90元，其动态市盈率达到百倍。二是今年该公司业绩大幅滑坡。该公司预计，2021年1~9月营业收入为8.6亿元~9.5亿元，同比下滑57.48%至53.03%；预计归母净利润为4500万元~5400万元，同比下滑75.33%至70.40%；预计扣非后归母净利润为3000万元~3900万元，同比下滑84.63%至80.02%。也正因如此，中自科技上市首日破发并不令人意外，这也进一步证实投资者打新之盲目了。</p>
      <p class="one-p"><img class="content-picture" src="https://img1.mydrivers.com/img/20210706/S91792917-e725-484b-b8c9-b2d0eda32981.png">
      </p>
      <p class="one-p">当然，新股上市首日破发在A股市场还是比较少见的。中自科技是今年以来科创板第一家上市首日破发新股，也是科创板成立以来第二只上市首日破发新股。科创板第一只上市首日破发新股是<span class="linkNormal">建龙微纳</span>，其上市之日是2019年12月4日，距今已有一年零10个月，这也足见新股上市首日破发的现象在A股市场并不常见。</p>
      <p class="one-p">实际上，对于A股市场来说，新股上市首日破发是一件好事。虽然对于A股市场来说，新股破发现象并不少见，但这种新股破发大多都是新股上市之后经过了一轮甚至是几番的市场炒作之后，然后股价回落破发。这样的新股破发除了提醒投资者注意市场炒作的风险之外，其意义并不大。相反，新股上市首日破发意义更加重大。</p>
      <p class="one-p">首先，新股上市首日破发它有利于提醒询价机构理性询价，而不能为了得到新股份额一味报高价。因为参与新股询价的机构投资者在询价有效的情况下，也是要参与新股配售的。如果新股定价太高，上市就破发了，这对于询价机构来说当然也是不利的。因为他们参与的新股配售份额也会因为破发而出现浮亏。</p>
      <p class="one-p">其次，新股上市首日破发也有利于向投资者提醒打新的风险。因为A股市场长期以来的新股不败现象，结果导致投资者在打新时逢新必打，根本就不关心新股的基本面，同时也不关心新股的发行价格，甚至将高价发行的新股视为“肉签”股。虽然在过去也经常出现新股破发现象，但新股经过一番炒作之后的破发，并没有危及到打新者的利益，并不会让打新者增加风险意识。而只有新股上市首日破发，才会直接损害到打新者的利益，只有在这种情况下，打新者才会真正意识到打新的风险，从而让打新者关心到新股的基本面，学会理性打新。当然，要达到这个目的，还需要新股上市首日破发现象进一步增加，呈现出一种常态化，这样更有利于投资者理性打新。</p>
      <p class="one-p">此外，新股上市首日破发也有利于向市场警示炒新的风险。在新股不败的市场环境下，投资者除了盲目打新之外，还会盲目炒新，以至一只新股上市后，通常都会炒出几个、十几个甚至几十个涨停板出来。因此，一只新股上市，往往都会受到市场的投机炒作。而新股上市首日破发，对于炒新者是一个打击。因为炒新者盲目追进新股之后发现，股价不仅没有炒上去，相反股价在进一步下跌，炒新变成了套牢。因此，新股上市首日破发对于炒新者来说也是一种风险警示。</p>

    </Article>
  </div>
</template>

<script>
import Article from "@/widget/Article.vue";

export default {
  components: { Article },
};
</script>
