<%@page pageEncoding="UTF-8"%>
<%@taglib prefix="tagfiles" tagdir="/WEB-INF/tags/"%>
<tagfiles:common type="content" banner="../../images/contact.jpg" showPageHelper="true">
	<jsp:attribute name="body">
		
		<img src="../../images/about.jpg" width="100%" /> 
		<article>
<!-- Editable AREA|START -->
		<p>
80年代，耐克产品开始从田径场和体育馆进入寻常百姓家(特别是十几岁的少年)。耐克公司必须在不失去正规体育传统市场情况下，尽力扩大耐克广告的吸引力，为此耐克必须像Levi's品牌(牛仔服的领导品牌 牛仔裤的发明者李维·施特劳斯建立)一样，成为青年文化的组成部分和身份象征。耐克公司在两个完全不同的市场作战，它面临的难题是在适应流行意识和宣传体育成就上如何获得平衡与一致，耐克公司开始重新思考其广告策略了。</p>
			<p><img src="../../images/about1.png" style="float:left;margin-right:3%;" />
1986年的一则宣传耐克充气鞋垫的广告是真正的突破，在广告片中耐克公司采用一个崭新的创意，不是采用一味宣传产品技术性能和优势的惯常手法，而是由代表和象征嬉皮士的著名甲壳虫乐队演奏的著名歌曲《革命》，在反叛图新的节奏、旋律中，一群穿戴耐克产品的美国人正如痴如醉地进行健身锻炼，……这则广告准确地迎合了刚刚出现的健身运动的变革之风和时代新潮，让感觉耳目一新。耐克公司原先一直采用杂志作为主要广告媒体，向竞技选手们传递产品的信息，但自此以后，电视广告成为耐克的主要“发言人”，这一举措使得耐克广告更能适应其产品市场的新发展。</p>
			<p>
耐克公司拓展市场的首要突破口是青少年市场，这一市场上的消费者有一些共同的特征：热爱运动、崇敬英雄人物，追星意识强烈，希望受人重视，思维活跃，想象力丰富并充满梦想。针对青少年消费者的这一特征，耐克相继与一些大名鼎鼎、受人喜爱的体育明星签约，如c罗、德罗巴、小罗、托雷斯、法布雷加斯、伊布、罗比尼奥、阿圭罗等。并拍摄了许多想象力十足的广告，如2010年南非世界杯的宣传片《踢出传奇》就在5月22日欧冠决赛时首播。</p>

<!-- Editable AREA|END -->
		</article>
	
	</jsp:attribute>
</tagfiles:common>

