INSERT INTO `auth_access_token` (`id`, `access_token`, `user_id`, `user_name`, `client_id`, `expires_in`, `grant_type`, `scope`, `create_date`) VALUES
	(1, '1.e74f975492bf580ff3f696d86d773ea9083afcfc.2592000.1653644731', 1, 'admin', 1, 1653644731, 'authorization_code', 'basic', '2021-12-21 21:10:53'),
	(3, '1.49c95a9f19aa00a6278af8f31d450a013d3fd561.2592000.1653755008', 1, 'admin', 1, 1653755008, 'authorization_code', 'DEFAULT_SCOPE', '2022-04-27 22:15:40');


INSERT INTO `user_role` (`id`, `name`, `content`, `parent_id`, `tenant_id`, `stat`, `create_sum`, `read_sum`, `update_sum`, `delete_sum`, `creator`, `create_date`, `update_date`) VALUES
	(1, '超级管理员', '拥有最高权限', 0, 0, NULL, 10, 20, NULL, NULL, NULL, '2022-04-18 21:36:24', '2022-04-18 21:40:03'),
	(2, '技术人员', NULL, 0, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-19 11:23:05', '2022-04-19 11:23:05'),
	(3, '开发者', NULL, 2, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-19 11:23:13', '2022-04-19 11:23:13'),
	(4, '测试者', NULL, 2, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-19 11:23:23', '2022-04-19 11:23:23'),
	(5, '运维人员', NULL, 2, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-19 11:23:39', '2022-04-19 11:23:39'),
	(6, '用户', '外部用户', 0, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-19 11:24:11', '2022-04-19 11:24:11'),
	(7, '一般用户', NULL, 6, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-19 11:24:22', '2022-04-19 11:24:22'),
	(8, 'VIP 用户', NULL, 6, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-19 11:24:30', '2022-04-19 11:24:30'),
	(9, '后台管理用户', NULL, 0, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-19 11:24:55', '2022-04-19 11:24:55'),
	(10, '运营商', NULL, 9, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-19 11:25:02', '2022-04-19 11:25:02'),
	(11, '厂家', NULL, 9, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-19 11:25:11', '2022-04-19 11:25:11'),
	(12, 'jlkj', 'lkjk88659808', 11, 0, NULL, 0, 0, 0, 0, NULL, '2022-04-25 16:53:39', '2022-04-25 16:53:39');